tests/performance_tests/reports/20260121_916.txt
--------------------------------
Summary report @ 09:16:17(+0100)
--------------------------------

errors.ETIMEDOUT: .............................................................. 17
http.codes.200: ................................................................ 763
http.codes.429: ................................................................ 415
http.downloaded_bytes: ......................................................... 1167432
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 1195
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 527
  mean: ........................................................................ 9.9
  median: ...................................................................... 2
  p95: ......................................................................... 10.1
  p99: ......................................................................... 202.4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 527
  mean: ........................................................................ 14.3
  median: ...................................................................... 2
  p95: ......................................................................... 82.3
  p99: ......................................................................... 242.3
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 10
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 1178
vusers.completed: .............................................................. 433
vusers.created: ................................................................ 450
vusers.created_by_name.Basic Dashboard Performance Test: ....................... 218
vusers.created_by_name.Health Check Test: ...................................... 138
vusers.created_by_name.Light Cache Performance Test: ........................... 94
vusers.failed: ................................................................. 17
vusers.session_length:
  min: ......................................................................... 1008.7
  max: ......................................................................... 5039.8
  mean: ........................................................................ 3203.8
  median: ...................................................................... 2018.7
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 5065.6



  Summary report @ 09:11:30(+0100)
--------------------------------

http.codes.200: ................................................................ 808
http.codes.202: ................................................................ 1
http.codes.429: ................................................................ 417
http.downloaded_bytes: ......................................................... 1183483
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 1226
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 454
  mean: ........................................................................ 12.6
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 368.8
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 454
  mean: ........................................................................ 18.1
  median: ...................................................................... 2
  p95: ......................................................................... 77.5
  p99: ......................................................................... 383.8
http.response_time.4xx:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 1226
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.Basic Dashboard Performance Test: ....................... 237
vusers.created_by_name.Health Check Test: ...................................... 124
vusers.created_by_name.Light Cache Performance Test: ........................... 89
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1008.7
  max: ......................................................................... 5570.4
  mean: ........................................................................ 3425.3
  median: ...................................................................... 4965.3
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 5378.9