tests/performance_tests/reports/20260121_936.txt
--------------------------------
Summary report @ 09:36:15(+0100)
--------------------------------

http.codes.200: ................................................................ 794
http.codes.429: ................................................................ 415
http.downloaded_bytes: ......................................................... 1161779
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 1209
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 497
  mean: ........................................................................ 13.2
  median: ...................................................................... 2
  p95: ......................................................................... 7
  p99: ......................................................................... 354.3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 497
  mean: ........................................................................ 19.1
  median: ...................................................................... 2
  p95: ......................................................................... 100.5
  p99: ......................................................................... 399.5
http.response_time.4xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 1.8
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 1209
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.Basic Dashboard Performance Test: ....................... 225
vusers.created_by_name.Health Check Test: ...................................... 141
vusers.created_by_name.Light Cache Performance Test: ........................... 84
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1008.5
  max: ......................................................................... 5510.1
  mean: ........................................................................ 3356.8
  median: ...................................................................... 2618.1
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 5378.9



  --------------------------------
Summary report @ 09:38:55(+0100)
--------------------------------

errors.ETIMEDOUT: .............................................................. 16
http.codes.200: ................................................................ 781
http.codes.429: ................................................................ 415
http.downloaded_bytes: ......................................................... 1181222
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 1212
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 533
  mean: ........................................................................ 12.6
  median: ...................................................................... 2
  p95: ......................................................................... 24.8
  p99: ......................................................................... 340.4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 533
  mean: ........................................................................ 18.4
  median: ...................................................................... 2
  p95: ......................................................................... 102.5
  p99: ......................................................................... 383.8
http.response_time.4xx:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 1.7
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 1196
vusers.completed: .............................................................. 434
vusers.created: ................................................................ 450
vusers.created_by_name.Basic Dashboard Performance Test: ....................... 239
vusers.created_by_name.Health Check Test: ...................................... 122
vusers.created_by_name.Light Cache Performance Test: ........................... 89
vusers.failed: ................................................................. 16
vusers.session_length:
  min: ......................................................................... 1007.3
  max: ......................................................................... 5044
  mean: ........................................................................ 3367.2
  median: ...................................................................... 4965.3
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 5065.6